---
kind: property
id: P:Autodesk.Revit.DB.ConicalSurface.HalfAngle
source: html/6f71508a-2228-bd57-f851-d2d540f4704e.htm
---
# Autodesk.Revit.DB.ConicalSurface.HalfAngle Property

Cone angle.

## Syntax (C#)
```csharp
public double HalfAngle { get; }
```